/** @file

;******************************************************************************
;* Copyright (c) 2024, Insyde Software Corp. All Rights Reserved.
;*
;* You may not reproduce, distribute, publish, display, perform, modify, adapt,
;* transmit, broadcast, present, recite, release, license or otherwise exploit
;* any part of this publication in any form, by any means, without the prior
;* written permission of Insyde Software Corporation.
;*
;******************************************************************************
*/

/=#

#string STR_MISC_BIOS_VERSION          #language en-US  "Fox.05.46.50.0022"
#string STR_MISC_SYSTEM_PRODUCT_NAME   #language en-US  "FOX-REMBRANDT"
#string STR_MISC_SYSTEM_MANUFACTURER   #language en-US  "AMD"
#string STR_MISC_SYSTEM_FAMILY         #language en-US  "REMBRANDT"
#string STR_AGESA_VERSION_VALUE        #language en-US  "EmbeddedPI-FP7R2 1.0.0.C"

#string STR_BIOS_VERSION_STRING        #language en-US  "BIOS Version"
#string STR_BIOS_VERSION_2_STRING      #language en-US  "InsydeH2O Version"

//
// The STR_CCB_VERSION is for Insyde internal code sync only.
// DO NOT modify it.
//
#string STR_CCB_VERSION                #language en-US  "05.46.50"

#string STR_MISC_BIOS_RELEASE_DATE     #language en-US  "12/30/2024"

//
// System Firmware Version in the ESRT table
//
#string STR_ESRT_VERSION                       #language en-US  "72504022"
#string STR_ESRT_LOWEST_SUPPORTED_VERSION      #language en-US  "52430000"
#string STR_FW_VERSION_STRING                  #language en-US  "Firmware Version"
#string STR_FW_VERSION_HELP                    #language en-US  "Show all the firmware version"
#string STR_PSP_FW_VERSION_STRING              #language en-US  "PSP BootLoader Version"
#string STR_PSP_FW_VERSION_VALUE               #language en-US  "0"
#string STR_PSP_SECURE_OS_VERSION_STRING       #language en-US  "PSP SecureOS Version"
#string STR_PSP_SECURE_OS_VERSION_VALUE        #language en-US  "0"
#string STR_XHCI_FW_VERSION_STRING             #language en-US  "XHCI FW Version"
#string STR_XHCI_FW_VERSION_VALUE              #language en-US  "0"
#string STR_IMC_FW_VERSION_STRING              #language en-US  "IMC FW Version"
#string STR_IMC_FW_VERSION_VALUE               #language en-US  "0"
#string STR_UCODE_LEVEL_VERSION_STRING         #language en-US  "Ucode Patch Level"
#string STR_UCODE_LEVEL_VERSION_VALUE          #language en-US  "0"
#string STR_SMU_FW_VERSION_STRING              #language en-US  "SMU FW Version"
#string STR_SMU_FW_VERSION_VALUE               #language en-US  "0"
#string STR_GOP_VERSION_STRING                 #language en-US  "GOP Driver Version"
#string STR_GOP_VERSION_VALUE                  #language en-US  "0"
#string STR_VBIOS_VERSION_STRING               #language en-US  "VBIOS Version"
#string STR_VBIOS_VERSION_VALUE                #language en-US  "0"
#string STR_AHCI_DRIVER_VERSION_STRING         #language en-US  "AHCI Driver Version"
#string STR_AHCI_DRIVER_VERSION_VALUE          #language en-US  "0"
#string STR_AHCI_ROM_VERSION_STRING            #language en-US  "AHCI OpROM Version"
#string STR_AHCI_ROM_VERSION_VALUE             #language en-US  "0"
#string STR_PT_FW_VERSION_STRING               #language en-US  "Promontory Firmware Version"
#string STR_PT_FW_VERSION_VALUE                #language en-US  "0"
#string STR_ABL_VERSION_STRING                 #language en-US  "ABL Version"
#string STR_ABL_VERSION_VALUE                  #language en-US  "N/A"
#string STR_APCB_VERSION_STRING                 #language en-US  "APCB Version"
#string STR_APCB_VERSION_VALUE                  #language en-US  "N/A"
#string STR_APOB_VERSION_STRING                 #language en-US  "APOB Version"
#string STR_APOB_VERSION_VALUE                  #language en-US  "N/A"
#string STR_APPB_VERSION_STRING                 #language en-US  "APPB Version"
#string STR_APPB_VERSION_VALUE                  #language en-US  "N/A"
#string STR_SVC_VERSION_STRING                 #language en-US  "SVC Version"
#string STR_SVC_VERSION_VALUE                  #language en-US  "N/A"

//
// ESRT FIRMWARE GUID of CRBs will all be 12B99262-648C-4365-BAFD-EB869FB7EB47
// WARNING!! OEM project need to use different GUID.
#string STR_ESRT_FIRMWARE_GUID         #language en-US  "12B99262-648C-4365-BAFD-EB869FB7EB47"
//PBS OPTIONS

#string STR_LAN_POWER_STRING                         #language en-US        "LAN Power Enable"
#string STR_LAN_POWER_HELP                           #language en-US        "Enable or disable LAN Power"

#string STR_MEM_VDDIO_ADJ_EN                         #language en-US        "Adjust MEM VDDIO"
#string STR_MEM_VDDIO_ADJ_INC                        #language en-US        "Increase VDDIO"
#string STR_MEM_VDDIO_ADJ_DEC                        #language en-US        "Decrease VDDIO"
#string STR_MEM_VDDIO_ADJ_HELP                       #language en-US        "Adjust MEM VDDIO, stepping is 4mV. VddIo = 1.2V +/- N * 4 mV, input rang is 0-30. Tunning range is +/- 120 mV"
#string STR_MEM_VDDIO_ADJ_VALUE                      #language en-US        "Adjust MME VDDIO Value"

#string STR_APU_VDDP_ADJ_EN                         #language en-US        "Adjust APU VDDP"
#string STR_APU_VDDP_ADJ_INC                        #language en-US        "Increase APU VDDP"
#string STR_APU_VDDP_ADJ_DEC                        #language en-US        "Decrease APU VDDP"
#string STR_APU_VDDP_ADJ_HELP                       #language en-US        "Adjust APU VDDP, stepping is 2mV. Vddp = 1.05V +/- N * 2 mV, input rang is 0-30. Tunning range is +/- 60 mV"
#string STR_APU_VDDP_ADJ_VALUE                      #language en-US        "Adjust APU VDDP Value"

#string STR_VREF_18_ADJ_EN                         #language en-US        "Adjust V1.8"
#string STR_VREF_18_ADJ_INC                        #language en-US        "Increase V1.8"
#string STR_VREF_18_ADJ_DEC                        #language en-US        "Decrease V1.8"
#string STR_VREF_18_ADJ_HELP                       #language en-US        "Adjust V1.8, stepping is 3mV. V1.8 = 1.8V +/- N * 3 mV, input rang is 0-33. Tunning range is +/- 100 mV"
#string STR_VREF_18_ADJ_VALUE                      #language en-US        "Adjust V1.8 Value"

#string STR_VTT_MEM_ADJ_EN                         #language en-US        "Adjust VTT MEM"
#string STR_VTT_MEM_ADJ_HELP                       #language en-US        "Adjust VTT MEM, stepping is VDDIO * (1/256). VTT_MEM = VDDIO * (N / 256), input rang is 113-143."
#string STR_VTT_MEM_ADJ_VALUE                      #language en-US        "Adjust VTT MEM Value"

#string STR_MEM_VREF_ADJ_EN                         #language en-US        "AddCmd MemVref  Adjust"
#string STR_MEM_VREF_ADJ_HELP                       #language en-US        "AddCmd MemVref  Adjust, stepping is VDDIO * (1/256). MEM_VREF = VDDIO * (N / 256), input rang is 114-142."
#string STR_MEM_VREF_ADJ_VALUE                      #language en-US        "AddCmd MemVref  Adjust Value"

#string STR_EXT_CLK_GEN_SATA_DISP0_EN               #language en-US        "External Clock Gen - SATA DISP0"
#string STR_EXT_CLK_GEN_SATA_DISP0_HELP             #language en-US        "Enable External Clock Gen - SATA DISP0"
#string STR_EXT_CLK_GEN_SATA_DISP0_91_25            #language en-US        "91.25 MHz"
#string STR_EXT_CLK_GEN_SATA_DISP0_92_50            #language en-US        "92.50 MHz"
#string STR_EXT_CLK_GEN_SATA_DISP0_93_75            #language en-US        "93.75 MHz"
#string STR_EXT_CLK_GEN_SATA_DISP0_95_00            #language en-US        "95.00 MHz"
#string STR_EXT_CLK_GEN_SATA_DISP0_96_25            #language en-US        "96.25 MHz"
#string STR_EXT_CLK_GEN_SATA_DISP0_97_50            #language en-US        "97.50 MHz"
#string STR_EXT_CLK_GEN_SATA_DISP0_98_75            #language en-US        "98.75 MHz"
#string STR_EXT_CLK_GEN_SATA_DISP0_100_00           #language en-US        "100.00 MHz"
#string STR_EXT_CLK_GEN_SATA_DISP0_101_25           #language en-US        "101.25 MHz"
#string STR_EXT_CLK_GEN_SATA_DISP0_102_50           #language en-US        "102.50 MHz"
#string STR_EXT_CLK_GEN_SATA_DISP0_103_75           #language en-US        "103.75 MHz"
#string STR_EXT_CLK_GEN_SATA_DISP0_105_00           #language en-US        "105.00 MHz"
#string STR_EXT_CLK_GEN_SATA_DISP0_106_25           #language en-US        "106.25 MHz"
#string STR_EXT_CLK_GEN_SATA_DISP0_107_50           #language en-US        "107.50 MHz"
#string STR_EXT_CLK_GEN_SATA_DISP0_108_75           #language en-US        "108.75 MHz"

#string STR_IMC_ENABLE_STRING                        #language en-US        "IMC Fan Control"
#string STR_IMC_ENABLE_HELP                          #language en-US        "Enable/disable IMC Fan Control. "

#string STR_IMC_CTL_FAN_STRING                       #language en-US        "IMC Fan Control"
#string STR_IMC_CTL_FAN_HELP                         #language en-US        "Enable/disable IMC Fan Control."
#string STR_IMC_CTL_FAN_PAGE_HELP                    #language en-US        "Enable or disable external codec through header"

#string STR_IMC_ENABLE_STRING                        #language en-US        "IMC Fan Control"
#string STR_IMC_ENABLE_HELP                          #language en-US        "Enable/disable IMC Fan Control. "
#string STR_STRAP_TEXT                               #language en-US        "Auto"                                                                                                                      
#string STR_IMC_FANPOLICY_STRING                     #language en-US        "Fan Policy"
#string STR_IMC_FANPOLICY_HELP                       #language en-US        "Set IMC Fan Policy to Performance/Quiet Mode"
#string STR_IMC_FANPOLICY_PERFORMANCE_TEXT           #language en-US        "Performance"
#string STR_IMC_FANPOLICY_QUIET_TEXT                 #language en-US        "Quiet"
#string STR_CPU_AC0_STRING                           #language en-US        "CPU AC0"
#string STR_CPU_AC0_HELP                             #language en-US        "CPU AC0"

#string STR_CPU_AC1_STRING                           #language en-US        "CPU AC1"
#string STR_CPU_AC1_HELP                             #language en-US        "CPU AC1"

#string STR_CPU_AC2_STRING                           #language en-US        "CPU AC2"
#string STR_CPU_AC2_HELP                             #language en-US        "CPU AC2"

#string STR_CPU_AC3_STRING                           #language en-US        "CPU AC3"
#string STR_CPU_AC3_HELP                             #language en-US        "CPU AC3"

#string STR_CPU_AC4_STRING                           #language en-US        "CPU AC4"
#string STR_CPU_AC4_HELP                             #language en-US        "CPU AC4"

#string STR_CPU_AC5_STRING                           #language en-US        "CPU AC5"
#string STR_CPU_AC5_HELP                             #language en-US        "CPU AC5"

#string STR_CPU_AC6_STRING                           #language en-US        "CPU AC6"
#string STR_CPU_AC6_HELP                             #language en-US        "CPU AC6"

#string STR_CPU_AC7_STRING                           #language en-US        "CPU AC7"
#string STR_CPU_AC7_HELP                             #language en-US        "CPU AC7"
#string STR_THERM_SOLUTION_STRING                    #language en-US        "Thermal Solution"
#string STR_THERM_SOLUTION_HELP                      #language en-US        "Thermal Solution"

#string STR_SOLUTION_35W_TEXT                        #language en-US        "35W"
#string STR_SOLUTION_45W_TEXT                        #language en-US        "45W"
#string STR_SOLUTION_65W_TEXT                        #language en-US        "65W"
#string STR_CPU_AL3_STRING                           #language en-US        "CPU AL3"
#string STR_CPU_AL3_HELP                             #language en-US        "CPU AL3"

#string STR_CPU_AL4_STRING                           #language en-US        "CPU AL4"
#string STR_CPU_AL4_HELP                             #language en-US        "CPU AL4"

#string STR_CPU_AL5_STRING                           #language en-US        "CPU AL5"
#string STR_CPU_AL5_HELP                             #language en-US        "CPU AL5"

#string STR_CPU_AL6_STRING                           #language en-US        "CPU AL6"
#string STR_CPU_AL6_HELP                             #language en-US        "CPU AL6"

#string STR_CPU_AL7_STRING                           #language en-US        "CPU AL7"
#string STR_CPU_AL7_HELP                             #language en-US        "CPU AL7"
#string STR_THERMAL_ZONECTRL1_STRING                 #language en-US        "Fan Cntr Option 1"
#string STR_THERMAL_ZONECTRL1_HELP                   #language en-US        "Thermal Fan Control Option"
#string STR_THERMAL_ZONECTRL2_STRING                 #language en-US        "Fan Cntr Option 2"
#string STR_THERMAL_ZONECTRL2_HELP                   #language en-US        "Thermal Fan Control Option"

#string STR_KBC_SUPPORT_STRING                       #language en-US        "KBC Support" 
#string STR_KBC_SUPPORT_HELP                         #language en-US        "Enable/Disable KBC Support under OS"
#string STR_AMD_STARTUPPWM_ENABLE_STRING             #language en-US        "AMD StartUp PWM Enable" 
#string STR_AMD_STARTUPPWM_ENABLE_HELP               #language en-US        "Enable/Disable AMD StartUp PWM"

#string STR_AMD_STARTUP_PWM_STRING                   #language en-US        "StartUp PWM" 
#string STR_AMD_STARTUP_PWM_HELP                     #language en-US        "AMD StartUp PWM Value"


#string STR_SATA_REDRIVER_ENABLE_STRING              #language en-US        "SATA Redriver Tuning"
#string STR_SATA_REDRIVER_ENABLE_HELP                #language en-US        "Enable/Disable SATA Redriver Tuning "
#string STR_SATA_REDRIVER_PAGE_HELP                  #language en-US        "SATA Redriver Tuning Page"
#string STR_SATA0_REDRIVER_THRESHOLD_ASSERT_CHA_STRING                  #language en-US        "SATA0 Redriver CHA SD Assert Thresholds"
#string STR_SATA0_REDRIVER_THRESHOLD_ASSERT_CHA_HELP                    #language en-US        "SATA0 Redriver CHA SD Assert Thresholds: Use only if register 0x08[6]=1. Register 0x12[3:2]"
#string STR_SATA0_REDRIVER_THRESHOLD_ASSERT_CHB_STRING                  #language en-US        "SATA0 Redriver CHB SD Assert Thresholds"
#string STR_SATA0_REDRIVER_THRESHOLD_ASSERT_CHB_HELP                    #language en-US        "SATA0 Redriver CHB SD Assert Thresholds: Use only if register 0x08[6]=1. Register 0x19[3:2]"
#string STR_SATA1_REDRIVER_THRESHOLD_ASSERT_CHA_STRING                  #language en-US        "SATA1 Redriver CHA SD Assert Thresholds"
#string STR_SATA1_REDRIVER_THRESHOLD_ASSERT_CHA_HELP                    #language en-US        "SATA1 Redriver CHA SD Assert Thresholds: Use only if register 0x08[6]=1. Register 0x12[3:2]"
#string STR_SATA1_REDRIVER_THRESHOLD_ASSERT_CHB_STRING                  #language en-US        "SATA1 Redriver CHB SD Assert Thresholds"
#string STR_SATA1_REDRIVER_THRESHOLD_ASSERT_CHB_HELP                    #language en-US        "SATA1 Redriver CHB SD Assert Thresholds: Use only if register 0x08[6]=1. Register 0x19[3:2]"
#string STR_SATA_REDRIVER_THRESHOLD_ASSERT_0         #language en-US        "50mV (00'b)"
#string STR_SATA_REDRIVER_THRESHOLD_ASSERT_1         #language en-US        "40mV (01'b)"
#string STR_SATA_REDRIVER_THRESHOLD_ASSERT_2         #language en-US        "75mV (02'b)"
#string STR_SATA_REDRIVER_THRESHOLD_ASSERT_3         #language en-US        "58mV (03'b)"

#string STR_SATA0_REDRIVER_THRESHOLD_DEASSERT_CHA_STRING                  #language en-US        "SATA0 Redriver CHA SD De-assert Thresholds"
#string STR_SATA0_REDRIVER_THRESHOLD_DEASSERT_CHA_HELP                    #language en-US        "SATA0 Redriver CHA SD De-assert Thresholds: Use only if register 0x08[6]=1. Register 0x12[1:0]"
#string STR_SATA0_REDRIVER_THRESHOLD_DEASSERT_CHB_STRING                  #language en-US        "SATA0 Redriver CHB SD De-assert Thresholds"
#string STR_SATA0_REDRIVER_THRESHOLD_DEASSERT_CHB_HELP                    #language en-US        "SATA0 Redriver CHB SD De-assert Thresholds: Use only if register 0x08[6]=1. Register 0x19[1:0]"
#string STR_SATA1_REDRIVER_THRESHOLD_DEASSERT_CHA_STRING                  #language en-US        "SATA1 Redriver CHA SD De-assert Thresholds"
#string STR_SATA1_REDRIVER_THRESHOLD_DEASSERT_CHA_HELP                    #language en-US        "SATA1 Redriver CHA SD De-assert Thresholds: Use only if register 0x08[6]=1. Register 0x12[1:0]"
#string STR_SATA1_REDRIVER_THRESHOLD_DEASSERT_CHB_STRING                  #language en-US        "SATA1 Redriver CHB SD De-assert Thresholds"
#string STR_SATA1_REDRIVER_THRESHOLD_DEASSERT_CHB_HELP                    #language en-US        "SATA1 Redriver CHB SD De-assert Thresholds: Use only if register 0x08[6]=1. Register 0x19[1:0]"
#string STR_SATA_REDRIVER_THRESHOLD_DEASSERT_0       #language en-US        "37mV (00'b)"
#string STR_SATA_REDRIVER_THRESHOLD_DEASSERT_1       #language en-US        "22mV (01'b)"
#string STR_SATA_REDRIVER_THRESHOLD_DEASSERT_2       #language en-US        "55mV (02'b)"
#string STR_SATA_REDRIVER_THRESHOLD_DEASSERT_3       #language en-US        "45mV (03'b)"

#string STR_SATA0_REDRIVER_EQ_CONTROL_CHA_STRING                  #language en-US        "SATA0 Redriver CHA EQ Control"
#string STR_SATA0_REDRIVER_EQ_CONTROL_CHA_HELP                    #language en-US        "SATA0 Redriver CHA EQ Control. Register 0xF[1:0]"
#string STR_SATA0_REDRIVER_EQ_CONTROL_CHB_STRING                  #language en-US        "SATA0 Redriver CHB EQ Control"
#string STR_SATA0_REDRIVER_EQ_CONTROL_CHB_HELP                    #language en-US        "SATA0 Redriver CHB EQ Control. Register 0x16[1:0]"
#string STR_SATA1_REDRIVER_EQ_CONTROL_CHA_STRING                  #language en-US        "SATA1 Redriver CHA EQ Control"
#string STR_SATA1_REDRIVER_EQ_CONTROL_CHA_HELP                    #language en-US        "SATA1 Redriver CHA EQ Control. Register 0xF[1:0]"
#string STR_SATA1_REDRIVER_EQ_CONTROL_CHB_STRING                  #language en-US        "SATA1 Redriver CHB EQ Control"
#string STR_SATA1_REDRIVER_EQ_CONTROL_CHB_HELP                    #language en-US        "SATA1 Redriver CHB EQ Control. Register 0x16[1:0]"
#string STR_SATA_REDRIVER_EQ_CONTROL_0               #language en-US        "Level 1 (00'b)"
#string STR_SATA_REDRIVER_EQ_CONTROL_1               #language en-US        "Level 2 (01'b)"
#string STR_SATA_REDRIVER_EQ_CONTROL_2               #language en-US        "Level 3 (02'b)"
#string STR_SATA_REDRIVER_EQ_CONTROL_3               #language en-US        "Level 4 (03'b)"

#string STR_SATA0_REDRIVER_VOD_DB_CHA_STRING                  #language en-US        "SATA0 Redriver CHA OUTA VOD_DB"
#string STR_SATA0_REDRIVER_VOD_DB_CHA_HELP                    #language en-US        "SATA0 Redriver CHA OUTA VOD_DB. Register 0x11[2:0]"
#string STR_SATA0_REDRIVER_VOD_DB_CHB_STRING                  #language en-US        "SATA0 Redriver CHB OUTB VOD_DB"
#string STR_SATA0_REDRIVER_VOD_DB_CHB_HELP                    #language en-US        "SATA0 Redriver CHB OUTB VOD_DB. Register 0x18[2:0]"
#string STR_SATA1_REDRIVER_VOD_DB_CHA_STRING                  #language en-US        "SATA1 Redriver CHA OUTA VOD_DB"
#string STR_SATA1_REDRIVER_VOD_DB_CHA_HELP                    #language en-US        "SATA1 Redriver CHA OUTA VOD_DB. Register 0x11[2:0]"
#string STR_SATA1_REDRIVER_VOD_DB_CHB_STRING                  #language en-US        "SATA1 Redriver CHB OUTB VOD_DB"
#string STR_SATA1_REDRIVER_VOD_DB_CHB_HELP                    #language en-US        "SATA1 Redriver CHB OUTB VOD_DB. Register 0x18[2:0]"
#string STR_SATA_REDRIVER_VOD_DB_0               #language en-US        "   0 dB (00'b)"
#string STR_SATA_REDRIVER_VOD_DB_1               #language en-US        "-1.5 dB (01'b)"
#string STR_SATA_REDRIVER_VOD_DB_2               #language en-US        "-3.5 dB (02'b)"
#string STR_SATA_REDRIVER_VOD_DB_3               #language en-US        "  -5 dB (03'b)"
#string STR_SATA_REDRIVER_VOD_DB_4               #language en-US        "  -6 dB (04'b)"
#string STR_SATA_REDRIVER_VOD_DB_5               #language en-US        "  -8 dB (05'b)"
#string STR_SATA_REDRIVER_VOD_DB_6               #language en-US        "  -9 dB (06'b)"
#string STR_SATA_REDRIVER_VOD_DB_7               #language en-US        " -12 dB (07'b)"

#string STR_SATA0_REDRIVER_VOD_CONTROL_CHA_STRING                  #language en-US        "SATA0 Redriver CHA VOD Control: VOD/VID Ratio"
#string STR_SATA0_REDRIVER_VOD_CONTROL_CHA_HELP                    #language en-US        "SATA0 Redriver CHA VOD Control: VOD/VID Ratio. Register 0x25[4:2]"
#string STR_SATA0_REDRIVER_VOD_CONTROL_CHB_STRING                  #language en-US        "SATA0 Redriver CHB VOD Control: VOD/VID Ratio"
#string STR_SATA0_REDRIVER_VOD_CONTROL_CHB_HELP                    #language en-US        "SATA0 Redriver CHB VOD Control: VOD/VID Ratio. Register 0x2D[4:2]"
#string STR_SATA1_REDRIVER_VOD_CONTROL_CHA_STRING                  #language en-US        "SATA1 Redriver CHA VOD Control: VOD/VID Ratio"
#string STR_SATA1_REDRIVER_VOD_CONTROL_CHA_HELP                    #language en-US        "SATA1 Redriver CHA VOD Control: VOD/VID Ratio. Register 0x25[4:2]"
#string STR_SATA1_REDRIVER_VOD_CONTROL_CHB_STRING                  #language en-US        "SATA1 Redriver CHB VOD Control: VOD/VID Ratio"
#string STR_SATA1_REDRIVER_VOD_CONTROL_CHB_HELP                    #language en-US        "SATA1 Redriver CHB VOD Control: VOD/VID Ratio. Register 0x2D[4:2]"
#string STR_SATA_REDRIVER_VOD_CONTROL_0               #language en-US        "   0 dB (00'b)"
#string STR_SATA_REDRIVER_VOD_CONTROL_1               #language en-US        "-1.5 dB (01'b)"
#string STR_SATA_REDRIVER_VOD_CONTROL_2               #language en-US        "-3.5 dB (02'b)"
#string STR_SATA_REDRIVER_VOD_CONTROL_3               #language en-US        "  -5 dB (03'b)"
#string STR_SATA_REDRIVER_VOD_CONTROL_4               #language en-US        "  -6 dB (04'b)"
#string STR_SATA_REDRIVER_VOD_CONTROL_5               #language en-US        "  -8 dB (05'b)"
#string STR_SATA_REDRIVER_VOD_CONTROL_6               #language en-US        "  -9 dB (06'b)"
#string STR_SATA_REDRIVER_VOD_CONTROL_7               #language en-US        " -12 dB (07'b)"


//
// BDS Hot Key Description Strings
//
#string STR_OEM_BADGING_STR_ESC           #language en-US  "Press Esc for boot options"
#string STR_OEM_BADGING_STR_ESC_SELECT    #language en-US  "Esc is pressed. Go to boot options."

#string STR_REMOTE_ASSISTANCE_KEY         #language en-US  "F9"
#string STR_REMOTE_ASSISTANCE_BEFORE_STR  #language en-US  "Press F9 Go to ME Remote Assistance."
#string STR_REMOTE_ASSISTANCE_AFTER_STR   #language en-US  "F9 is pressed. Go to ME Remote Assistance."

#string STR_MEBX_KEY                      #language en-US  "F10"
#string STR_MEBX_BEFORE_STR               #language en-US  "Press F10 go to MEBx"
#string STR_MEBX_AFTER_STR                #language en-US  "F10 is pressed. Go to MEBx."

//
// For ABT use
//
#string STR_DRIVER_PACKAGE_VERSION        #language en-US  "AMD_Ubuntu-22.04.3_Kernel_6.1.61_v2023_40_3290_GA"
